"""该项目的工具类"""


class DataTool:
    """静态数据类"""
    def __init__(self):
        # 项目管理员
        self.managers = ['zz106dyc', '李腾']

        # 人员类别分类
        self.tp = (
            ('教师', '教师'),
            ('食堂', '食堂'),
            ('保安', '保安'),
            ('物业', '物业'),
        )

        # 车牌号省份简称
        self.provinces = ['京', '津', '沪', '渝', '吉', '辽', '晋', '冀', '青', '鲁', '豫',
                          '苏', '皖', '浙', '闽', '赣', '湘', '鄂', '粤', '琼', '甘', '陕',
                          '贵', '滇', '川', '黑', '蒙', '新', '藏', '宁', '桂', '港', '澳']
