"""静态数据"""


class DataTool:
    def __init__(self):
        self.book_name = {
            1: '必修一',
            2: '必修二',
            3: '选择性必修一',
            4: '选择性必修二',
            5: '选择性必修三',
            6: '综合',
        }

        self.line_name = (
            ('函数主线', '函数主线'),
            ('几何与代数主线', '几何与代数主线'),
            ('概率与统计主线', '概率与统计主线'),
            ('数学建模主线', '数学建模主线'),
        )

        self.line_dict = {
            1: '函数主线',
            2: '几何与代数主线',
            3: '概率与统计主线',
            4: '数学建模主线',
        }

        self.chapter_list = {
            1: ['b1', 'b2', 'b3', 'b4', 'bjm', 'b5'],
            2: ['b6', 'b7', 'b8', 'b9', 'b10'],
            3: ['x1', 'x2', 'x3'],
            4: ['x4', 'x5'],
            5: ['x6', 'x7', 'x8', 'xjm'],
            6: ['xt', 'yd'],
        }

        self.chapter_name = {
            'b1': '必修第一章',
            'b2': '必修第二章',
            'b3': '必修第三章',
            'b4': '必修第四章',
            'bjm': '必修数学建模',
            'b5': '必修第五章',
            'b6': '必修第六章',
            'b7': '必修第七章',
            'b8': '必修第八章',
            'b9': '必修第九章',
            'b10': '必修第十章',
            'x1': '选择性必修第一章',
            'x2': '选择性必修第二章',
            'x3': '选择性必修第三章',
            'x4': '选择性必修第四章',
            'x5': '选择性必修第五章',
            'x6': '选择性必修第六章',
            'x7': '选择性必修第七章',
            'x8': '选择性必修第八章',
            'xjm': '选择性必修数学建模',
            'xt': '数学文化习题',
            'yd': '数学文化阅读材料',
        }

    def get_book_id(self, chapter_id):
        """返回章节所在的课本id"""
        for book_id, cps in self.chapter_list.items():
            if chapter_id in cps:
                return book_id
