"""班级卫生记分程序的工具类"""


class DataTool:
    def __init__(self):
        # 班级数字与名称之间的对应
        self.cs_dict = {}
        for i in range(1, 13):
            self.cs_dict[i] = str(i) + '班'

        # 年级
        self.grades = (('高一', '高一'), ('高二', '高二'), ('高三', '高三'))
        self.grades_num = {'高一': 1, '高二': 2, '高三': 3}
        self.reverse_grade_num = {1: '高一', 2: '高二', 3: '高三'}

        # 项目管理员
        self.super_users = [
            'zz106dyc',
            '李宪伟',
            '刘明杰',
            '刘慧依',
            '袁叶',
            '牛俊雅',
            '张志云',
            '程宝强',
            '常新辉',
        ]

        # 基础卫生区
        self.base_area = ['教室', '画室', '走廊']

        # 各班清洁区
        self.special_area = [
            '1～2西楼梯',
            '1～2东楼梯',
            '2～3西楼梯',
            '2～3东楼梯',
            '3～4西楼梯',
            '3～4东楼梯',
            '4～5西楼梯',
            '4～5东楼梯',
            '二层西窗',
            '二层东窗',
            '三层西窗',
            '三层东窗',
            '四层西窗',
            '四层东窗',
            '二层南北空地',
            '三层南北空地',
        ]

        # 班级密码
        self.class_pwd = {
            # 高一二层
            '高一1班': '039970',
            '高一2班': '876993',
            '高一3班': '283121',
            '高一4班': '919633',

            # 高一三层
            '高一5班': '405386',
            '高一6班': '908904',
            '高一7班': '740878',
            '高一8班': '429466',

            # 高一四层
            '高一9班': '061508',
            '高一10班': '064784',
            '高一11班': '231305',
            '高一12班': '567967',

            # 高二二层
            '高二1班': '640987',
            '高二2班': '314171',
            '高二3班': '489121',
            '高二4班': '419095',

            # 高二三层
            '高二5班': '402791',
            '高二6班': '401692',
            '高二7班': '105187',
            '高二8班': '131639',

            # 高二四层
            '高二9班': '322066',
            '高二10班': '172457',
            '高二11班': '532383',
            '高二12班': '169602',

            # 高三二层
            '高三1班': '880896',
            '高三2班': '799622',
            '高三3班': '665066',
            '高三4班': '165379',

            # 高三三层
            '高三5班': '144989',
            '高三6班': '344388',
            '高三7班': '198421',
            '高三8班': '103640',

            # 高三四层
            '高三9班': '609896',
            '高三10班': '287387',
            '高三11班': '166512',
            '高三12班': '326777',
        }

        # 检查人及对应密码
        self.owners = (
            ('秦萌', '秦萌'),
            ('李安琪', '李安琪'),
            ('李嘉仪', '李嘉仪'),
            ('刘笑含', '刘笑含'),
            ('景思源', '景思源'),
            ('曾子羊', '曾子羊'),
            ('章家绮', '章家绮'),
            ('钟筱涵', '钟筱涵'),
            ('王晨曦', '王晨曦'),
            ('谷昭希', '谷昭希'),
            ('田雨泽', '田雨泽'),
            ('张兴隆', '张兴隆'),
            ('侯柯欣', '侯柯欣'),
            ('陈艺元', '陈艺元'),
            ('种孜硕', '种孜硕'),
            ('赵妙格', '赵妙格'),
            ('郭欣怡', '郭欣怡'),
            ('徐婉婷', '徐婉婷'),
            ('王粲然', '王粲然'),
            ('赵婉妤', '赵婉妤'),
            ('杜佩颖', '杜佩颖'),
            ('丁心茗', '丁心茗'),
            ('贺诣然', '贺诣然'),
            ('常艺馨', '常艺馨'),
            ('王诗瑶', '王诗瑶'),
            ('赵乃琳', '赵乃琳'),
            ('侯宇凡', '侯宇凡'),
        )
        self.owners_pwd = {
            '丁心茗': '611334',
            '侯宇凡': '204361',
            '侯柯欣': '254440',
            '刘笑含': '173682',
            '常艺馨': '781372',
            '张兴隆': '021793',
            '徐婉婷': '116891',
            '景思源': '057265',
            '曾子羊': '295063',
            '李嘉仪': '916115',
            '李安琪': '813898',
            '杜佩颖': '085190',
            '王晨曦': '634717',
            '王粲然': '581470',
            '王诗瑶': '183739',
            '田雨泽': '005096',
            '种孜硕': '303626',
            '秦萌': '270329',
            '章家绮': '248099',
            '谷昭希': '378026',
            '贺诣然': '588301',
            '赵乃琳': '881711',
            '赵妙格': '123044',
            '赵婉妤': '630819',
            '郭欣怡': '045379',
            '钟筱涵': '840995',
            '陈艺元': '523878'
        }

        # 卫生部人数及当前届
        self.n = 27
        self.g = '2026'

        # 卫生问题
        self.desc = {
            'd1': '空调上面有明显灰尘',
            'd2': '前后门的小窗户有灰尘',
            'd3': '画室物品没有摆放好',
            'd4': '画室地面没有打扫干净',
            'd5': '教室地面没有打扫干净',
            'd6': '清洁区地面没有打扫干净',
            'd7': '有学生在教室内没有着上下全身校服',
            'd8': '有学生在教室内佩戴饰品',
            'd9': '黑板槽、讲台、多媒体等其他地方不干净',
        }

    def get_choices(self):
        """获取卫生区二维元组"""
        area_list = []
        for area in self.base_area:
            area_list.append((area, area))
        for area in self.special_area:
            area_list.append((area, area))
        return tuple(area_list)

    def get_class(self):
        """生成所有班级字符串"""
        class_list = []
        for grade in self.grades:
            for c in range(1, 13):
                cs = grade[0] + str(c) + '班'
                class_list.append((cs, cs))

        return tuple(class_list)

    @staticmethod
    def str_two(n):
        """整数n格式化为两位数字字符串"""
        if n < 10:
            return '0' + str(n)
        else:
            return str(n)

    def get_owners(self):
        """获取学生会卫生部的所有检查者代号"""
        owners = []
        for i in range(self.n):
            owners.append(self.g + '03' + self.str_two(i))
        return owners

    def get_gc(self, grade_num):
        """以列表形式返回一个年级的所有班级字符串"""
        grade = self.reverse_grade_num[grade_num]
        gc_list = []
        for i in range(1, 13):
            gc_list.append(grade + str(i) + '班')
        return gc_list
