"""方便调用的工具类"""
import re


class DataTool:
    """静态数据类"""
    def __init__(self):
        # 项目管理员
        self.manager = ['zz106dyc', '李宪伟', '王春']
        self.su = ['zz106dyc']

        # 年级
        self.grades = {1: '高一', 2: '高二'}
        self.grades_reverse = {'高一': 1, '高二': 2}
        self.grades_tuple = (('高一', '高一'), ('高二', '高二'))

        # 各年级班级数
        self.n = 12

        # 匹配数字
        self.num_regex = re.compile(r'\d+')

        # 运动项目
        self.items = [
            '100米',
            '200米',
            '800米',
            '1500米',
            '跳高',
            '跳远',
            '实心球',
        ]

        # 项目分组方式
        self.item_group = {
            '100米': 1,      # 方式1：6人一组
            '200米': 1,
            '800米': 2,      # 方式2：分两大组
            '1500米': 2,
            '跳高': 3,        # 方式3：分一大组
            '跳远': 3,
            '实心球': 3,
        }

        # 年级序号
        self.grade_num = {'高一': '4', '高二': '5'}

        # 班级口令
        self.class_pwd = {
            '2023': {
                '高一10班': '118087',
                '高一11班': '507208',
                '高一12班': '211036',
                '高一1班': '535693',
                '高一2班': '002298',
                '高一3班': '232017',
                '高一4班': '483041',
                '高一5班': '903226',
                '高一6班': '164254',
                '高一7班': '037181',
                '高一8班': '276621',
                '高一9班': '711911',
                '高二10班': '165603',
                '高二11班': '233085',
                '高二12班': '153609',
                '高二1班': '758367',
                '高二2班': '268880',
                '高二3班': '244342',
                '高二4班': '537183',
                '高二5班': '780516',
                '高二6班': '537677',
                '高二7班': '978269',
                '高二8班': '465858',
                '高二9班': '670599',
            },
            '2024': {
                '高一10班': '972753',
                '高一11班': '156511',
                '高一12班': '205414',
                '高一1班': '176824',
                '高一2班': '749343',
                '高一3班': '000364',
                '高一4班': '673406',
                '高一5班': '418247',
                '高一6班': '492559',
                '高一7班': '232331',
                '高一8班': '631787',
                '高一9班': '588175',
                '高二10班': '074274',
                '高二11班': '330292',
                '高二12班': '354647',
                '高二1班': '043358',
                '高二2班': '301405',
                '高二3班': '851724',
                '高二4班': '940476',
                '高二5班': '844142',
                '高二6班': '723560',
                '高二7班': '125784',
                '高二8班': '339956',
                '高二9班': '563918',
            },
            '2025': {
                '高一1班': '601240',
                '高一2班': '192307',
                '高一3班': '461515',
                '高一4班': '527194',
                '高一5班': '627648',
                '高一6班': '656896',
                '高一7班': '015572',
                '高一8班': '638048',
                '高一9班': '977376',
                '高一10班': '257848',
                '高一11班': '400399',
                '高一12班': '436708',
                '高二1班': '621259',
                '高二2班': '543692',
                '高二3班': '036150',
                '高二4班': '581872',
                '高二5班': '569007',
                '高二6班': '818197',
                '高二7班': '448182',
                '高二8班': '267396',
                '高二9班': '603334',
                '高二10班': '881569',
                '高二11班': '726574',
                '高二12班': '547575',
            },
        }

        # 一行最多编号数
        self.max_cols = 8

    def get_class(self):
        """生成所有班级字符串"""
        class_list = []
        for grade in self.grades.values():
            for c in range(1, self.n + 1):
                cs = grade + str(c) + '班'
                class_list.append((cs, cs))

        return tuple(class_list)

    def get_cs(self):
        """生成班级数字"""
        cs_list = []
        for i in range(1, self.n + 1):
            cs_list.append((i, i))

        return tuple(cs_list)

    def get_item_tuple(self):
        """取得运动项目的格式化元组"""
        item_list = []
        for item in self.items:
            item_list.append((item, item))

        return tuple(item_list)

    def get_item_idx(self):
        """返回项目索引字典"""
        # 项目个数序列
        rg = range(len(self.items))

        return dict(zip(self.items, rg))
