"""方便调用的静态数据类"""
import pytz


class DataTool:
    def __init__(self):
        # 项目管理员
        self.managers = ['zz106dyc', '李国红', '陈政', '胡庆周', '贾瑞法']

        # 管理员与负责考点的对应
        self.manager_points = {
            '李国红': '106初中',
            '陈政': '106高中',
            '胡庆周': '54中',
            '贾瑞法': '84中',
        }

        # 银行卡号前四位与所属银行对应
        self.bank_dict = {
            '4367': '建设银行',
            '6227': '建设银行',
            '6228': '农业银行',
            '9559': '农业银行',
            '6222': '工商银行',
            '9558': '工商银行',
            '6216': '中国银行',
            '4563': '中国银行',
            '6013': '中国银行',
            '6221': '邮政银行',
            '6210': '邮政银行',
            '6014': '交通银行',
            '5218': '交通银行',
            '6282': '光大银行',
            '3568': '光大银行',
            '6226': '民生银行',
            '4218': '民生银行',
            '6229': '兴业银行',
            '4864': '兴业银行',
            '6029': '平安银行',
            '9988': '平安银行',
            '6224': '郑州银行',
            '6235': '郑州银行',
        }

        # 设置时区
        self.tz = pytz.timezone('Asia/Shanghai')

        # 监考考点选项
        self.point_choices = (
            ('106初中', '106初中'),
            ('106高中', '106高中'),
            ('54中', '54中'),
            ('84中', '84中'),
        )
